Repository: ilwan07/ShortView
Catalog: shortview/locale/*/LC_MESSAGES/django.po
Languages: fr

source: ShortView Administration
fr: Administration ShortView

source: ShortView Admin Portal
fr: Portail administrateur ShortView

source: Welcome to the ShortView Administration Interface
fr: Bienvenue sur l'Interface d'Administration ShortView

source: General
fr: Général

source: Date and time
fr: Date et heure

source: Email notifications
fr: Notifications email

source: Never notify
fr: Jamais notifer

source: Notify first click
fr: Notifier premier clic

source: Notify each click
fr: Notifier chaque clic

source: delete expired links
fr: supprimer liens expirés

source: hide expired links
fr: cacher liens expirés

source: default link life duration
fr: durée de vie du lien par défaut

source: send email on link click
fr: envoyer email lorsque lien cliqué

source: receive the newsletters
fr: reçevoir les bulletins

source: %(user)s's profile
fr: profil de %(user)s

source: User preference
fr: Préférence utilisateur

source: date of creation
fr: date de création

source: life duration
fr: durée de vie

source: destination url
fr: url de destination

source: destination domain
fr: domaine de destination

source: still active
fr: encore actif

source: receiver ip
fr: ip du receveur

source: date of clicking
fr: date du clic

source: request header
fr: en-tête de la requête

source: Home
fr: Accueil

source: Admin access
fr: Accès administrateur

source: Preferences
fr: Préférences

source: Log out
fr: Se déconnecter

source: %(username)s's home page
fr: Page d'accueil de %(username)s

source: Create a new tracked link
fr: Créer un nouveau lien suivi

source: Tracked links:
fr: Liens suivis :

source: click%(plur)s
fr: clic%(plur)s

source: You haven't created any link yet.
fr: Vous n'avez encore créé aucun lien.

source: Welcome to ShortView!
fr: Bienvenue sur ShortView !

source: Register
fr: S'enregister

source: Log in
fr: Se connecter

source: What is ShortView?
fr: Qu'est-ce que ShortView ?

source: With this platform, you can shorten a link you want to share with people, and monitor when these links have been opened.
fr: Avec cette plateforme, vous pouvez raccourcir un lien que vous voulez partager à d'autres personnes, et vérifier lorsque ces liens ont été ouverts.

source: So it allows do do two things at the same time: shorten a long link if you need to, and allow tracking of the link!
fr: Cela permet donc de faire deux choses à la fois : raccourcir un lien trop long si cela est nécessaire, et permettre le suivi de ce lien !

source: How does this work?
fr: Comment cela fonctionne-t-il ?

source: To achieve that, this platform will create a shortened link to the destination url you want to share.
fr: Pour réussir à faire cela, cette plateforme va créer un lien raccourci qui pointe vers l'url de destination que vous souhaitez partager.

source: When people will click this link, they will send a request to our servers with the id of the link they clicked.
fr: Lorsque quelqu'un clique sur ce lien, cela va envoyer une requête à nos serveurs avec l'identifiant du lien sur lequel la personne à cliqué.

source: The server will then register that this link has been clicked, with data such as the ip of the person who clicked and the date.
fr: Le serveur va ensuite enregistrer le fait que ce lien ait été cliqué, avec des informations telles que l'ip de la personne ayant cliqué et la date.

source: After registering the action, the server will perform a redirection to the destination url.
fr: Une fois l'action enregistrée, le serveur va effectuer une redirection vers l'url de destination.

source: This whole process is practically instant for the user who clicked the link.
fr: Ce processus est presque instantané pour la personne qui clique sur le lien.

source: Who can I send tracked links to?
fr: À qui puis-je envoyer des liens suivis ?

source: Make sure that the people you're going to send tracked links to are aware that their clicks will be registered.
fr: Assurez-vous que les personnes à qui vous allez envoyer des liens suivis savent que leurs clics seront enregistrés.

source: Never send it without telling that you're collecting the person's activity, as it may constitute a privacy violation.
fr: N'en envoyez jamais un sans prévenir que vous enregistrez l'activité de la personne, puisque cela pourrait constituer une violation de la vie privée.

source: Conditions of Use
fr: Conditions d'utilisation

source: Back to home page
fr: Retour à l'accueil

source: By using ShortView, you agree to the following conditions:
fr: En utilisant ShortView, vous acceptez les conditions suivantes :

source: Summary of the conditions: This service is provided for free but without any guarantees. You must not use it for illegal activities, you must inform the people you share links with of the tracking, we reserve the right to take actions on your account if necessary.
fr: Récapitulatif des conditions : Ce service est fourni gratuitement, mais sans aucune garantie. Vous ne devez pas l'utiliser pour des activités illégales, et vous devez informer les personnes avec lesquelles vous partagez des liens de leur suivi, nous nous réservons le droit de prendre des mesures sur votre compte si nécessaire.

source: ShortView is a free service to shorten links and track their usage. Therefore, we do not guarantee the availability or the proper functioning of the service at all times.
fr: ShortView est un service graduit pour raccourcir des liens et suivre leur utilisation. Ainsi, nous ne garantissons pas la disponibilité ou le bon fonctionnement de ce service en permanence.

source: You must not use ShortView for any illegal activities or to share malicious content. Furthermore, you need to make sure that the people you share the links with are aware that their clicks will be registered.
fr: Vous ne devez pas utiliser ShortView pour des activités illégales ou pour partager du contenu malveillant. De plus, vous devez vous assurer que les personnes avec qui vous partagez les liens savent que leurs clics sur ces derniers seront enregistrés.

source: We reserve the right to delete any link that violates our terms of service.
fr: Nous nous réservons le droit de supprimer les liens qui violent nos conditions d'utilisation.

source: We are not responsible for the content of the links you create. You are solely responsible for the links you shorten and share.
fr: Nous ne sommes pas responsables du contenu des liens que vous créez. Vous êtes entièrement responsables des liens que vous raccourcissez et partagez.

source: You agree to receive notifications about your links, including click notifications if enabled. You will be able to change the notification settings at any time in your preferences.
fr: Vous acceptez de reçevoir des notifications concernant vos liens, incluant des notifications de clics si l'option est activée. Vous pourrez changer vos paramètres de notification à tout instant dans vos préférences.

source: We may change these conditions at any time, and your continued use of the service implies acceptance of the new conditions.
fr: Nous pouvons changer ces conditions à tout instant, et votre usage continu du service implique que vous acceptez les nouvelles conditions.

source: We reserve the right to suspend or terminate your account if you violate these conditions, or if deemed necessary, even if you did not directly violate them.
fr: Nous nous réservons le droit de suspendre ou supprimer votre compte si vous violez ces conditions, ou si cela est jugé nécessaire, même si vous n'avez pas directement enfreint les conditions.

source: We reserve the right to modify the service, including the features and functionalities, at any time without prior notice.
fr: Nous nous réservons le droit de modifier le service, incluant les fontionnalités, à n'importe quel instat sans préavis.

source: Again, this service is provided as is, without any warranties or guarantees. We do not guarantee that the service will be uninterrupted or error-free. If you encounter any issues, you can report them to us and we will try to fix them in the extend of our possibilities.
fr: À nouveau, ce service est fourni tel quel, sans aucune garantie. Nous ne garantissons pas que le service sera ininterrompu ou sans erreurs. Si vous rencontrez un problème avec la plateforme, vous pouvez nous le signaler et nous tenterons de le résoudre dans la mesure de nos possibilités.

source: If you do not agree with these conditions, you must stop using the service immediately.
fr: Si vous êtes en désaccord avec ces conditions, vous devez arrêter d'utiliser le service immédiatement.

source: Passwords security
fr: Sécurité des mots de passe

source: How do we securely store your passwords?
fr: Comment stockons-nous vos mots de passe de manière sécurisée ?

source: To secure passwords, this platform uses a robust hashing function known as
fr: Pour sécuriser les mots de passe, cette plateforme utilise une fonction de hachage robuse connue sous le nom

source: https://en.wikipedia.org/wiki/Argon2
fr: https://fr.wikipedia.org/wiki/Argon2

source: , which is the winner of the
fr: , qui est gagnant de la

source: https://en.wikipedia.org/wiki/Password_Hashing_Competition
fr: https://fr.wikipedia.org/wiki/Password_Hashing_Competition

source: 2015 Password Hashing Competition
fr: Compétition de hachage de mots de passe de 2015

source: and is still recognized as one of the strongest security standards today.
fr: et est toujours reconnue comme l'un des standards de sécurité les plus forts à l'heure actuelle.

source: No one, including the platform admins, can see or obtain your password, even with full access to the user database or in the case of a database leak.
fr: Personne, même les administrateurs de la plateforme, ne peut voir ou obtenir vos mots de passe, même avec un accès complet à la base de donnée d'utilisateurs ou dans le cas d'une fuite de a base de données.

source: That's also why we can't give your password back if you forget it.
fr: C'est également pourquoi nous ne pouvons pas vous redonner votre mot de passe si vous l'oubliez.

source: Here is an explanation on how we secure them:
fr: Voici une explication sur la façon dont nous les sécurisons :

source: When creating your account, the system will create for your user a piece of randomly generated text, called the "salt", which will be added at the end of your password.
fr: Lorsque vous créez votre compte, le système va vous créer un morceau de texte généré aléatoirement, appelé le "salage" (ou "salt" en anglais), qui va être ajouté à la fin de votre mot de passe.

source: Then, we take the password followed by the salt, which is the "salted password", and apply a hashing algorithm on it, which is built with cryptography in mind.
fr: Ensuite, nous prenons le mot de passe suivi du salage, qui est le "mot de passe salé", et appliquons un algorithme de hachage ("hashing en anglais"), qui est conçu spécifiquement pour un usage cryptographique.

source: Hashing is a one way process, which will take the given data as an input, and will generate its "hash", which cannot be turned back into the original password, but putting the same salted password as an input will output the exact same hash, and that is how we know if the password is correct when you try to log in.
fr: Le hachage est une procédure à sens unique, qui va prendre la donnée en entrée, et va générer son "hash", qui ne pourra pas être retransformé en son mot de passe original, mais redonner exacteent le même mot de passe salé en entrée redonnera exactement le même hash, et c'est ainsi que nous savons si le mot de passe entré est valide lorsque vous essayez de vous connecter.

source: Inside the database, we only store your identification informations, which are the username, email, and eventually other identification informations provided by you, and we then store for each user the hash from the salted password, along with the salt.
fr: Dans la base de donnée, nous stockons seulement vos informations d'identification, qui sont le nom d'utilisateur, l'email, et éventuellement d'autres informations d'identification que vous avez fournies, et nous stockons pour chaque utilisateur le hash du mot de passe salé, ainsi que le salage.

source: This way, your original password will never be directly visible nor obtainable from the database.
fr: En procédant ainsi, votre mot de passe original de sera jamais directement visible ni obtenable depuis la base de données.

source: This method secures your password against most attacks, including:
fr: Cette méthode sécurise votre mot de passe contre la plupart des attaques, incluant :

source: Database leaks: your password isn't directly obtainable from the database, even with full access to it.
fr: Les fuites de base de données : votre mot de passe n'est pas directement obtenable depuis la base de données, même avec un accès complet à celle-ci.

source: Rainbow table attacks: this attack consists of trying to see if the hash of the most common passwords matches with one of the registered users. But since each user has a unique salt added at the end of the password before hashing, a generic rainbow table attack would be completely inefficient.
fr: Les attaques "rainbow table" : cette attaque consiste à vérifier si le hash des mots de passe les plus communs correspond avec ceux des utilisateurs enregistrés. Mais comme chaque utilisateur possède un salage unique ajouté à la fin de leur mot de passe avant le hachage, une attaque "rainbow table" générique serait complètement inefficace.

source: Matching users with same password: again, since each user has a unique salt, two users with the same exact password will have different hashes associated with their account in the database, therefore preventing attackers from directly knowing if two or more users share the same password.
fr: Faire correspondre des utilisateurs avec le même mot de passe : encore une fois, comme chaque utilisateur possède un salage unique, deux utilisateurs possédant exactement le même mot de passe auront des hashes différents associés à leur compte dans la base de donnée, ce qui empêche les attaquants de directement savoir si deux utilisateurs ou plus partagent le même mot de passe.

source: Brute force attacks: the hashing algorithm used to transform the passwords has a high work factor, meaning that it takes time to hash a password and check if the output hash is the same as the one from the database. When a user tries to log in with a password, this delay is almost unnoticeable, but in the case of a brute force attack where the attacker is testing a lot of different possible passwords, the attack will be rendered almost inefficient as it takes way too long to try a lot of different passwords.
fr: Attaques par force brute : l'algorithme de hachage utilisé pour transformer les mots de passe possède un facteur de travail élevé, ce qui signifie que hacher le mot de passe et vérifier si le hash correspond à celui de la base de données prend du temps. Lorsqu'un utilisateur tente de se connecter avec un mot de passe, ce délai est presque imperçeptible, mais dans le cas d'une attaque par force brute où l'attaquant teste un grand nombre de mots de passe possibles, l'attaque sera presque inefficace puisqu'il est bien trop long d'essayer de hacher un grand nombre de mots de passe.

source: Hashing collision attacks: when two different passwords are passed to a hashing algorithm and give the same output hash, this is called a hashing collision. However, the hashing algorithm we use has a very high collision resistance, meaning that it's impossible with today's means to develop a method aiming to find a hashing collision, so it's impossible in practice for someone to log into your account using a different password from the one you set.
fr: Attaques par collision de hachage : lorsque deux mots de passe différents sont passés dans l'algorithme de hachage et donne le même hash en sortie, cela est appelé une collision de hachage. Cependant, l'algorithme de hachage que nous utilisons possède une très forte résistance aux collisions, ce qui signifie qu'il est impossible avec les techniques actuelles de développer une méthode ayant pour but de trouver une collision de hachage, il est donc en pratique impossible pour quelqu'un de se connecter à votre compte en utilisant un mot de passe différent de celui que vous avez entré.

source: Moreover, all of these procedures aiming to securely store and check your passwords are handled by Django's backend, which is a well known, trustable and secure framework used by huge companies around the world.
fr: De plus, l'ensemble de ces procédures ayant pour but de stocker et vérifier vos mots de passe de manière sécurisée sont gérées par le backend Django, qui est un framework bien connu, digne de confiance et largement utilisé par de grandes entreprises dans le monde entier.

source: For more informations on how Django's backend manages the passwords with the above methods, you can go on
fr: Pour plus d'informations sur la manière dont le backend Django gère les mots de passe avec les méthodes ci-dessus, vous pouvez consulter

source: https://docs.djangoproject.com/en/5.2/topics/auth/passwords/
fr: https://docs.djangoproject.com/fr/5.2/topics/auth/passwords/

source: this page
fr: cette page

source: Login
fr: Se connecter

source: Back to index page
fr: Retour à la page d'index

source: Error:
fr: Erreur :

source: Log in using your credentials
fr: Connectez-vous en utilisant vos identifiants

source: Username/Email:
fr: Nom d'utilisateur/Email :

source: username/email
fr: nom d'utilisateur/email

source: Password:
fr: Mot de passe :

source: password
fr: mot de passe

source: Create Link
fr: Créer un lien

source: tracked link description
fr: description du lien suivi

source: Full destination URL:
fr: URL de destination complète :

source: Time before the link expires (days/hours/minutes/seconds):
fr: Temps avant expiration du lien (jours/heures/minutes/secondes) :

source: Never expire:
fr: N'expire jamais :

source: Email notification mode:
fr: Mode de notification email :

source: Create the link
fr: Créer le lien

source: Change your preferences below, then hit apply
fr: Changer vos préférences ci-dessous, puis cliquez sur appliqer

source: Global preferences
fr: Préférences globales

source: Automatically delete expired links (including the current ones)
fr: Supprimer les liens expirés automatiquement (incluant ceux actuels)

source: Hide expired links:
fr: Cacher liens expirés :

source: Email preferences
fr: Préférences email :

source: Receive email newsletters:
fr: Reçevoir les bulletins par email :

source: Apply preferences
fr: Appliquer les préférences

source: Register your new account
fr: Enregistrez votre nouveau compte

source: Username:
fr: Nom d'utilisateur :

source: Between 3 and 50 characters, can only contain letters, numbers, and these symbols: _ + . -
fr: Entre 3 et 50 caractères, peut uniquement contenir des lettres, chiffres, et ces symboles : _ + . -

source: username
fr: nom d'utilisateur

source: Enter your email address here
fr: Entrez votre adresse email ici

source: Enter a secure password here: at least 8 characters, not only numbers, do not use common passwords
fr: Entrez un mot de passe sécurisé ici : au moins 8 caractères, pas seulement des chiffres, n'utilisez pas un mot de passe commun

source: Confirm password:
fr: Confirmation du mot de passe :

source: Retype the same password again here
fr: Réécrivez le même mot de passe ici

source: I have read and accept the
fr: J'ai lu et accepté les

source: conditions of use of the service
fr: conditions d'utilisation du service

source: The tracked link to send is the following (click to copy):
fr: Le lien suivi à envoyer est le suivant (clic pour copier) :

source: Original destination link:
fr: Lien de destination original :

source: This link is expired
fr: Ce lien est expiré

source: Delete this link
fr: Supprimer ce lien

source: This link hasn't been clicked yet, no tracker available.
fr: Ce lien n'a pas encore été cliqué, aucun suivi disponnible.

source: Number
fr: Numéro

source: Opener's IP
fr: IP de l'ouvreur

source: Full request headers
fr: En-tête de la requête

source: See headers content
fr: Voir le contenu de l'en-tête

source: You need to fill in all the fields to register.
fr: Tous les champs doivent êtres rempli pour créer votre compte.

source: The username format is invalid, it must be between 3 and 50 characters, can only contain letters, numbers, and these symbols: _ + . -
fr: Le format du nom d'utilisateur est invalide, il doit contenir entre 3 et 50 caractères, peut uniquement contenir des lettres, chiffres, et ces symboles : _ + . -

source: This username already exists, try another one, or use the log in page if your account already exists.
fr: Ce nom d'utilisateur existe déjà, essayez-en un autre, ou utilisez la page de connexion si votre compte existe déjà.

source: The email format is invalid, please enter a valid email address.
fr: Le format de l'email est invalide, merci d'entrer une adresse email valide.

source: This email address is already in use, try logging in with it.
fr: Cette adresse email est déjà utilisée, essayez de vous connecter avec.

source: The two passwords you entered are different, you need to enter the same password twice.
fr: Les deux mots de passe entrés sont différents, vous devez entrer le même mot de passe deux fois.

source: The password you entered is not valid. %(errors)s
fr: Le mot de passe entré est invalide. %(errors)s

source: You need to fill in all the fields to log in.
fr: Tous les champs doivent êtres rempli pour vous connecter.

source: The %(login_type)s you entered isn't registered. Make sure the %(login_type)s is correct, or use the register button to create a new account.
fr: Votre %(login_type)s n'est pas enregistré. Assurez-vous que votre %(login_type)s est correct, ou utilisez le bouton d'enregistrement de compte pour créer un nouveau compte.

source: Multiple different users are using this %(login_type)s. This is an issue, please contact the developper to fix this.
fr: Plusieurs utilisateurs différents possèdent votre %(login_type)s. Ceci est un problème, merci de contacter le développeur pour le régler.

source: The credentials are invalid, make sure that the password is correct.
fr: Les identifiants sont invalides, vérifiez que le mot de passe est correct.

source: Some data is missing. Please fill the entire form.
fr: Certaines informations sont manquantes. Merci de remplir l'intégralité du formulaire.

source: You tried to set the lifetime value without using integers.
fr: Vous avez essayé de donner la durée de vie sans utiliser des nombres entiers.

source: The value for the notification preference is invalid.
fr: La valeur pour la préférence de notification est invalide.

source: Successfully applied the new preferences!
fr: Nouvelles préférences appliquées avec succès!

source: You cannot set another tracked url as the destination.
fr: Vous ne pouvez pas définir un autre url suivi comme destination.
